<?php 

return [
    'schedules' => 'شیڈولز',
    'manage-schedules' => 'شیڈولز کا منظم کریں',
    'create-schedule' => 'شیڈول بنائیں',
    'name' => 'نام',
    'last-run-at' => 'آخری بار دوڑا گیا',
    'next-run-at' => 'اگلا بار دوڑے گا',
    'status' => 'حالت',
    'active' => 'فعال',
    'inactive' => 'غیر فعال',
    'processing' => 'پروسیسنگ',
    'manage-schedule' => 'شیڈول کا منظم کریں',
    'new-task' => 'نیا ٹاسک',
    'run-now' => 'ابھی چلائیں',
    'editBtn' => 'ترتیب دیں',
    'n/a' => 'نہیں لاگو',
    'never' => 'کبھی نہیں',

    'no-schedules' => 'اس سرور کے لئے کوئی شیڈول تشکیل نہیں ہوئی ہے۔',
    'ignore-files-folders' => 'فائلیں اور فولڈرز کو نظرانداز کریں',
    'continues-on-failure' => 'ناکامی پر جاری رہتا ہے',
    'later' => 'بعد میں',

    'minute' => 'منٹ',
    'hour' => 'گھنٹہ',
    'day' => 'دن',
    'week' => 'ہفتہ',
    'day-of-month' => 'مہینے کا دن',
    'month' => 'مہینہ',
    'day-of-week' => 'ہفتے کا دن',

    'deleteTask' => [
        'title' => 'ٹاسک حذف کرنے کی تصدیق',
        'description' => 'کیا آپ یقینی ہیں کہ آپ یہ ٹاسک حذف کرنا چاہتے ہیں؟ یہ عمل واپس نہیں لیا جا سکتا۔',
        'delete' => 'ٹاسک حذف کریں'
    ],
    'delete' => [
        'title' => 'شیڈول حذف کریں',
        'description' => 'تمام ٹاسکز ہٹا دیے جائیں گے اور چل رہے ہونے والے کسی بھی پروسیس کو ختم کر دیا جائے گا۔',
        'delete' => 'حذف کریں'
    ],
    'edit' => [
        'title-1' => 'شیڈول ترتیب دیں',
        'title-2' => 'نیا شیڈول بنائیں',

        'description' => 'شیڈول سسٹم کا استعمال کرون جاب سنٹیکس کا استعمال کرتا ہے جب ٹاسک کب شروع ہونا چاہئے یہ تعین کرتے وقت۔ اوپر دی گئی فیلڈز استعمال کریں تاکہ مخصوص کریں کہ یہ ٹاسکس کب چلنا شروع ہوں گے۔',
        
        'name' => 'شیڈول کا نام',
        'name-description' => 'اس شیڈول کے لئے ایک انسان دوست نام۔',
        'cheatsheet' => 'چیٹ شیٹ دکھائیں',
        'cheatsheet-description' => 'کچھ مثالوں کے لئے کرون چیٹ شیٹ دکھائیں',
        'online-when-online' => 'صرف جب سرور آن لائن ہو',
        'online-when-online-description' => 'صرف اس شیڈول کو جاری رکھیں جب سرور چل رہا ہو۔',
        'enabled' => 'شیڈول فعال ہے',
        'enabled-description' => 'اگر چالو ہو تو یہ شیڈول خود بخود چلا جائے گا۔',

        'save-changes' => 'ترتیبات محفوظ کریں',
    ],
    'cheatsheet' => [
        'example' => 'مثالیں',
        'every-5-minutes' => 'ہر 5 منٹ',
        'every-hour' => 'ہر گھنٹہ',
        'hour-range' => 'گھنٹے کا رینج',
        'once-a-day' => 'روزانہ ایک مرتبہ',
        'every-monday' => 'ہر پیر',
        'special-characters' => 'خصوصی حروف',
        'any-value' => 'کوئی بھی قیمت',
        'value-list-separator' => 'قیمتوں کا فرق سے',
        'range-values
